polydisperseBubbleFoam/shockTube/shockTube_500/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

w       .01;
h       1;
depth   .01;

nPts    500;

vertices
(
    (   0       0       0       )   //0
    (   $w      0       0       )   //1
    (   $w      $h      0       )   //2
    (   0       $h      0       )   //3
    (   0       0       $depth  )   //4
    (   $w      0       $depth  )   //5
    (   $w      $h      $depth  )   //6
    (   0       $h      $depth  )   //7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 $nPts 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type            patch;
        faces
        (
            ( 0 1 5 4)
        );
    }
    outlet
    {
        type            patch;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //)))))
